Revit 2026 API

# UIControlledApplicationCreateRibbonPanel(String, String) Method

---
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual RibbonPanel CreateRibbonPanel(
	string tabName,
	string panelName
)
```
```vb
Public Overridable Function CreateRibbonPanel (
	tabName As String,
	panelName As String
) As RibbonPanel
```
```cpp
public:
virtual RibbonPanel^ CreateRibbonPanel(
	String^ tabName,
	String^ panelName
)
```
```fsharp
abstract CreateRibbonPanel :
        tabName : string *
        panelName : string -> RibbonPanel
override CreateRibbonPanel :
        tabName : string *
        panelName : string -> RibbonPanel
```

#### Parameters

tabName String

panelName String

#### Return Value

RibbonPanel

#### Reference

UIControlledApplication Class

CreateRibbonPanel Overload

Autodesk.Revit.UI Namespace